# Pandas Group

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({
    'key': ['A', 'B', 'C', 'A', 'B', 'C'],
    'data1': [1, 2, 3, 1, 2, 3],
    'data2': [4, 4, 6, 0, 6, 1]
})
df

  key  data1  data2
0   A      1      4
1   B      2      4
2   C      3      6
3   A      1      0
4   B      2      6
5   C      3      1

#### groupby함수
- 조건부로 묶고 싶은 col 값으로 묶음

In [4]:
tmp1 = df.groupby('key')
print(tmp1.groups)

{'A': [0, 3], 'B': [1, 4], 'C': [2, 5]}

In [5]:
# key 그룹으로 묶고 sum
df.groupby('key').sum()

     data1  data2
key
A        2      4
B        4     10
C        6      7

In [6]:
df.groupby(['key','data1']).sum()

           data2
key data1
A   1          4
B   2         10
C   3          7

#### aggregate 함수
- groupby를 통해서 집계를 한번에 계산하는 방법

In [7]:
# key값으로 묶고 data1과 data2의 최소 중간 최대값 출력
df.groupby('key').aggregate([min,np.median,max])

    data1            data2
      min median max   min median max
key
A       1      1   1     0    2.0   4
B       2      2   2     4    5.0   6
C       3      3   3     1    3.5   6

In [8]:
# key 값으로 묶고 data1은 최소값, data2는 최대값 출력
df.groupby('key').aggregate({'data1':min,'data2':max})

     data1  data2
key
A        1      4
B        2      6
C        3      6

#### filter 함수
- groupby를 통해서 그룹 속성을 기준으로 데이터 필터링

In [26]:
df = pd.DataFrame({
    'key': ['A', 'B', 'C', 'A', 'B', 'C'],
    'data1': [1, 2, 3, 1, 2, 3],
    'data2': [4, 4, 6, 0, 6, 1]
})
df.groupby('key')['data2'].mean()

key
A    2.0
B    5.0
C    3.5
Name: data2, dtype: float64

In [21]:
# data2의 평균이 3 이상인 key 값 집단 출력
df.groupby('key').filter(lambda x:x['data2'].mean() > 3)

  key  data1  data2
1   B      2      4
2   C      3      6
4   B      2      6
5   C      3      1

In [22]:
#  apply 함수 적용하여 최대값 - 최소값
df.groupby('key').apply(lambda x: x.max() - x.min())

     data1  data2
key
A        0      4
B        0      2
C        0      5

##### get_group 으로 데이터를 가져올 수 있다

In [23]:
df.groupby('key').get_group('A')

  key  data1  data2
0   A      1      4
3   A      1      0